; NOTE: Check that stackmaps can track additional registers.
; RUN: llc --yk-stackmap-spillreloads-fix --yk-stackmap-add-locs < %s | FileCheck %s

; To keep this test somewhat maintainable, just check for the existence of the
; num_extras field.

; NOTE: stackmap section
; CHECK-LABEL: __LLVM_StackMaps:
; NOTE: stackmap ID
; CHECK-LABEL: .quad 444
; NOTE: stackmap offset
; CHECK-NEXT: .long {{.*}}
; NOTE: reserved
; CHECK-NEXT: .short 0
; NOTE: num locations
; CHECK-NEXT: .short {{.*}}
; NOTE: num lives
; CHECK-NEXT: .byte 1
; NOTE: type
; CHECK-NEXT: .byte 1
; NOTE: reserved
; CHECK-NEXT: .byte 0
; NOTE: size
; CHECK-NEXT: .short {{.*}}
; NOTE: reg
; CHECK-NEXT: .short {{.*}}
; NOTE: reserved
; CHECK-NEXT: .short 0
; NOTE: num extras
; CHECK-NEXT: .short {{.*}}


; ModuleID = 'ld-temp.o'

target triple = "x86_64-unknown-linux-gnu"

%struct.YkLocation = type { i64 }

@.str = private unnamed_addr constant [14 x i8] c"out of memory\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [9 x i8] c"(stdout)\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [8 x i8] c"(stdin)\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [112 x i8] c"++++++++++[>+++++++>++++++++++>+++>+<<<<-]>++.>+.+++++++..+++.>++.<<+++++++++++++++.>.+++.------.--------.>+.>.\00", align 1, !dbg !17
@stdout = external dso_local local_unnamed_addr global ptr, align 8
@shadowstack_0 = thread_local global ptr null

; Function Attrs: noinline nounwind optnone uwtable

!92 = distinct !DILexicalBlock(scope: !64, file: !2, line: 51, column: 15)
!93 = !DILocation(line: 53, column: 7, scope: !92)
!94 = !DILocation(line: 56, column: 14, scope: !95)
!95 = distinct !DILexicalBlock(scope: !64, file: !2, line: 55, column: 15)
!96 = !DILocation(line: 57, column: 7, scope: !95)
!97 = !DILocation(line: 60, column: 19, scope: !98)
!98 = distinct !DILexicalBlock(scope: !99, file: !2, line: 60, column: 11)
!99 = distinct !DILexicalBlock(scope: !64, file: !2, line: 59, column: 15)
!100 = !DILocalVariable(name: "__c", arg: 1, scope: !101, file: !102, line: 82, type: !37)
!101 = distinct !DISubprogram(name: "putchar", scope: !102, file: !102, line: 82, type: !103, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !105)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!103 = !DISubroutineType(types: !104)
!104 = !{!37, !37}
!105 = !{!100}
!106 = !DILocation(line: 0, scope: !101, inlinedAt: !107)
!107 = distinct !DILocation(line: 60, column: 11, scope: !98)
!108 = !DILocation(line: 84, column: 21, scope: !101, inlinedAt: !107)
!109 = !{!110, !110, i64 0}
!110 = !{!"any pointer", !78, i64 0}
!111 = !DILocation(line: 84, column: 10, scope: !101, inlinedAt: !107)
!112 = !DILocation(line: 60, column: 26, scope: !98)
!113 = !DILocation(line: 60, column: 11, scope: !99)
!114 = !DILocation(line: 61, column: 9, scope: !98)
!115 = !DILocation(line: 65, column: 11, scope: !116)
!116 = distinct !DILexicalBlock(scope: !117, file: !2, line: 65, column: 11)
!117 = distinct !DILexicalBlock(scope: !64, file: !2, line: 64, column: 15)
!118 = !DILocation(line: 65, column: 39, scope: !116)
!119 = !DILocation(line: 65, column: 11, scope: !117)
!120 = !DILocation(line: 66, column: 9, scope: !116)
!121 = !DILocation(line: 70, column: 11, scope: !62)
!122 = !DILocation(line: 70, column: 17, scope: !62)
!123 = !DILocation(line: 70, column: 11, scope: !63)
!124 = !DILocation(line: 72, column: 9, scope: !61)
!125 = !DILocation(line: 0, scope: !61)
!126 = !DILocation(line: 73, column: 15, scope: !127)
!127 = distinct !DILexicalBlock(scope: !61, file: !2, line: 72, column: 22)
!128 = !DILocation(line: 74, column: 15, scope: !129)
!129 = distinct !DILexicalBlock(scope: !127, file: !2, line: 74, column: 15)
!130 = !DILocation(line: 74, column: 15, scope: !127)
!131 = distinct !{!131, !124, !132}
!132 = !DILocation(line: 80, column: 9, scope: !61)
!133 = !DILocation(line: 75, column: 23, scope: !134)
!134 = distinct !DILexicalBlock(scope: !135, file: !2, line: 75, column: 17)
!135 = distinct !DILexicalBlock(scope: !129, file: !2, line: 74, column: 29)
!136 = !DILocation(line: 75, column: 17, scope: !135)
!137 = !DILocation(line: 0, scope: !129)
!138 = !DILocation(line: 85, column: 11, scope: !68)
!139 = !DILocation(line: 85, column: 17, scope: !68)
!140 = !DILocation(line: 85, column: 11, scope: !69)
!141 = !DILocation(line: 87, column: 9, scope: !67)
!142 = !DILocation(line: 0, scope: !67)
!143 = !DILocation(line: 88, column: 15, scope: !144)
!144 = distinct !DILexicalBlock(scope: !67, file: !2, line: 87, column: 22)
!145 = !DILocation(line: 89, column: 15, scope: !146)
!146 = distinct !DILexicalBlock(scope: !144, file: !2, line: 89, column: 15)
!147 = !DILocation(line: 89, column: 15, scope: !144)
!148 = distinct !{!148, !141, !149}
!149 = !DILocation(line: 95, column: 9, scope: !67)
!150 = !DILocation(line: 90, column: 23, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !2, line: 90, column: 17)
!152 = distinct !DILexicalBlock(scope: !146, file: !2, line: 89, column: 29)
!153 = !DILocation(line: 90, column: 17, scope: !152)
!154 = !DILocation(line: 0, scope: !146)
!155 = !DILocation(line: 102, column: 9, scope: !65)
!156 = distinct !{!156, !72, !157, !158}
!157 = !DILocation(line: 103, column: 3, scope: !34)
!158 = !{!"llvm.loop.mustprogress"}
!159 = !DILocation(line: 104, column: 3, scope: !34)
!160 = !DISubprogram(name: "yk_mt_control_point", scope: !41, file: !41, line: 52, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !39, !43}
!163 = !DISubprogram(name: "errx", scope: !164, file: !164, line: 50, type: !165, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!164 = !DIFile(filename: "/usr/include/err.h", directory: "", checksumkind: CSK_MD5, checksum: "c1d02a7722f9cc1994ce2e5c5e6150dd")
!165 = !DISubroutineType(types: !166)
!166 = !{null, !37, !167, null}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!169 = !DISubprogram(name: "putc", scope: !170, file: !170, line: 550, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "b5a90985555f47bfb88eff5a8f0f5b72")
!171 = !DISubroutineType(types: !172)
!172 = !{!37, !37, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !175, line: 7, baseType: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !177, line: 49, size: 1728, elements: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !194, !196, !197, !198, !202, !204, !206, !210, !213, !215, !218, !221, !222, !223, !226, !227}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !176, file: !177, line: 51, baseType: !37, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !176, file: !177, line: 54, baseType: !38, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !176, file: !177, line: 55, baseType: !38, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !176, file: !177, line: 56, baseType: !38, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !176, file: !177, line: 57, baseType: !38, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !176, file: !177, line: 58, baseType: !38, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !176, file: !177, line: 59, baseType: !38, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !176, file: !177, line: 60, baseType: !38, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !176, file: !177, line: 61, baseType: !38, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !176, file: !177, line: 64, baseType: !38, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !176, file: !177, line: 65, baseType: !38, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !176, file: !177, line: 66, baseType: !38, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !176, file: !177, line: 68, baseType: !192, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !177, line: 36, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !176, file: !177, line: 70, baseType: !195, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !176, file: !177, line: 72, baseType: !37, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !176, file: !177, line: 73, baseType: !37, size: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !176, file: !177, line: 74, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!201 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !176, file: !177, line: 77, baseType: !203, size: 16, offset: 1024)
!203 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !176, file: !177, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !176, file: !177, line: 79, baseType: !207, size: 8, offset: 1048)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !176, file: !177, line: 81, baseType: !211, size: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !177, line: 43, baseType: null)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !176, file: !177, line: 89, baseType: !214, size: 64, offset: 1152)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !201)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !176, file: !177, line: 91, baseType: !216, size: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !177, line: 37, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !176, file: !177, line: 92, baseType: !219, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !177, line: 38, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !176, file: !177, line: 93, baseType: !195, size: 64, offset: 1344)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !176, file: !177, line: 94, baseType: !25, size: 64, offset: 1408)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !176, file: !177, line: 95, baseType: !224, size: 64, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !225, line: 13, baseType: !50)
!225 = !DIFile(filename: "target/debug/ykllvm/lib/clang/18/include/__stddef_size_t.h", directory: "/home/vext01/research/yk", checksumkind: CSK_MD5, checksum: "405db6ea5fb824de326715f26fa9fab5")
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !176, file: !177, line: 96, baseType: !37, size: 32, offset: 1536)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !176, file: !177, line: 98, baseType: !228, size: 160, offset: 1568)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 20)
!231 = !DISubprogram(name: "err", scope: !164, file: !164, line: 46, type: !165, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!232 = !DISubprogram(name: "read", scope: !233, file: !233, line: 371, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !37, !25, !224}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !170, line: 77, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !200, line: 194, baseType: !201)
!238 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 107, type: !239, scopeLine: 107, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !241)
!239 = !DISubroutineType(types: !240)
!240 = !{!37}
!241 = !{!242, !243, !244, !245, !246, !247}
!242 = !DILocalVariable(name: "cells", scope: !238, file: !2, line: 108, type: !38)
!243 = !DILocalVariable(name: "cells_end", scope: !238, file: !2, line: 111, type: !38)
!244 = !DILocalVariable(name: "mt", scope: !238, file: !2, line: 113, type: !39)
!245 = !DILocalVariable(name: "prog_len", scope: !238, file: !2, line: 116, type: !224)
!246 = !DILocalVariable(name: "yklocs", scope: !238, file: !2, line: 117, type: !43)
!247 = !DILocalVariable(name: "i", scope: !248, file: !2, line: 120, type: !224)
!248 = distinct !DILexicalBlock(scope: !238, file: !2, line: 120, column: 3)
!249 = !DILocation(line: 108, column: 17, scope: !238)
!250 = !DILocation(line: 0, scope: !238)
!251 = !DILocation(line: 109, column: 13, scope: !252)
!252 = distinct !DILexicalBlock(scope: !238, file: !2, line: 109, column: 7)
!253 = !DILocation(line: 109, column: 7, scope: !238)
!254 = !DILocation(line: 110, column: 5, scope: !252)
!255 = !DILocation(line: 113, column: 14, scope: !238)
!256 = !DILocation(line: 114, column: 3, scope: !238)
!257 = !DILocation(line: 117, column: 24, scope: !238)
!258 = !DILocation(line: 118, column: 14, scope: !259)
!259 = distinct !DILexicalBlock(scope: !238, file: !2, line: 118, column: 7)
!260 = !DILocation(line: 118, column: 7, scope: !238)
!261 = !DILocation(line: 120, column: 3, scope: !248)
!262 = !DILocation(line: 119, column: 5, scope: !259)
!263 = !DILocation(line: 111, column: 27, scope: !238)
!264 = !DILocation(line: 127, column: 3, scope: !238)
!265 = !DILocation(line: 129, column: 3, scope: !238)
!266 = !DILocation(line: 130, column: 3, scope: !238)
!267 = !DILocation(line: 131, column: 1, scope: !238)
!268 = !DILocation(line: 0, scope: !248)
!269 = !DILocation(line: 121, column: 23, scope: !270)
!270 = distinct !DILexicalBlock(scope: !271, file: !2, line: 121, column: 9)
!271 = distinct !DILexicalBlock(scope: !272, file: !2, line: 120, column: 41)
!272 = distinct !DILexicalBlock(scope: !248, file: !2, line: 120, column: 3)
!273 = !DILocation(line: 121, column: 9, scope: !271)
!274 = !DILocation(line: 122, column: 19, scope: !270)
!275 = !DILocation(line: 122, column: 7, scope: !270)
!276 = !DILocation(line: 124, column: 19, scope: !270)
!277 = !DILocation(line: 0, scope: !270)
!278 = !DILocation(line: 120, column: 37, scope: !272)
!279 = !DILocation(line: 120, column: 24, scope: !272)
!280 = distinct !{!280, !261, !281, !158}
!281 = !DILocation(line: 125, column: 3, scope: !248)
!282 = !DISubprogram(name: "calloc", scope: !283, file: !283, line: 556, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "4b47dc81a92f1fe77a152c0aac236718")
